config/major-modes/org.org
#+title: Org Mode Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle org.el
#+auto_tangle: y

* Introduction
This file configures Org mode, the powerful organizational tool at the heart of Emacs.
It includes settings for source blocks, appearance, agenda, export options, and various
org-related packages to enhance the experience.

* Basic Configuration
Setup lexical binding and ensure we're using the right org version.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-

;; Ensure we have a consistent org version
;; This is needed for compatibility with org-roam and other packages
(straight-use-package 'org)

;; ===============================================================================
;; Core Org Mode Settings
;; ===============================================================================

;; Source code blocks settings
(setq org-src-tab-acts-natively t)
(setq org-src-fontify-natively t)

;; Configure Babel languages
(org-babel-do-load-languages 'org-babel-load-languages
                             (append org-babel-load-languages
                                     '((python . t)
                                       (emacs-lisp . t)
                                       (js . t)
                                       (sql . t)
                                       (shell . t))))

;; Python specific settings
(setq org-babel-python-command "python3 2>&1")

;; Wrapping and line handling
(add-hook 'org-mode-hook 'visual-line-mode)
(setq org-startup-truncated nil)
#+end_src

* Display and Appearance
Packages and settings for enhancing the visual appearance of Org mode.

** Horizontal Scrolling
Enables proper horizontal scrolling in Org mode.

#+begin_src emacs-lisp
;; Enable horizontal scrolling
(use-package org-phscroll
  :straight '(org-phscroll :type git :host github :repo "misohena/phscroll"))

(with-eval-after-load "org"
  (require 'org-phscroll))
#+end_src

** Modern Look
Provides a cleaner, more modern appearance to Org mode.

#+begin_src emacs-lisp
;; Modern appearance for org mode
(use-package org-modern
  :straight t)
#+end_src

** Bullets
Replaces stars with nice-looking bullets.

#+begin_src emacs-lisp
;; Replace asterisks with bullets
(use-package org-bullets
  :straight t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

** Margin
Enhances the visual appearance of the org file margins.

#+begin_src emacs-lisp
;; Improved margins in Org mode
;; https://github.com/rougier/org-margin
(use-package org-margin
 :straight (org-margin :type git :host github :repo "rougier/org-margin"))

;; TODO add adaptive-wrap-prefix-mode
#+end_src

* Encryption
Configure Org crypt for encrypting sensitive information.

#+begin_src emacs-lisp
;; ===============================================================================
;; Configure Org Crypt
;; ===============================================================================

(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
(setq org-crypt-key nil)
#+end_src

* Export Configuration
Configure various export backends for Org mode.

#+begin_src emacs-lisp
;; ===============================================================================
;; Org Export Engine Config
;; ===============================================================================

;; Jira Export
(use-package ox-jira
  :straight t
  :config
  (setq org-export-copy-to-kill-ring 'if-interactive))
#+end_src

* Task Management
Configure Org mode for task management, TODO lists, and agenda views.

** Priority Settings
Configure priority levels and their appearance.

#+begin_src emacs-lisp
;; Priority range and defaults
(setq org-highest-priority ?A)
(setq org-lowest-priority ?C)
(setq org-default-priority ?A)

;; Priority appearance
(setq org-priority-faces '((?A . (:foreground "#F0DFAF" :weight bold))
                           (?B . (:foreground "LightSteelBlue"))
                           (?C . (:foreground "OliveDrab"))))
#+end_src

** Agenda Configuration

Setup for Org agenda views and files.

#+begin_src emacs-lisp
  ;; Agenda key binding
  (global-set-key (kbd "C-c a") 'org-agenda)

  ;; Function to refresh agenda files - recursively find all .org files in multiple directories
  (defun jf/refresh-org-agenda-files ()
    "Refresh org-agenda-files by rescanning jf/org-directory and ~/src/dotfiles/emacs/ for .org files."
    (interactive)
    (setq org-agenda-files
          (append (directory-files-recursively jf/org-directory "\\.org$")
                  (directory-files-recursively "~/src/dotfiles/emacs/" "\\.org$")))
    (when (called-interactively-p 'interactive)
      (message "Refreshed org-agenda-files: found %d files" (length org-agenda-files))))

  ;; Initialize agenda files
  (jf/refresh-org-agenda-files)

  ;; Display sorting for TODO items

  (setq org-agenda-sorting-strategy
        '((agenda time-up priority-down category-up)
          (todo priority-down alpha-up)
          (tags priority-down category-up alpha-up)
          (search category-up)))

  ;; Open agenda in current window
  (setq org-agenda-window-setup (quote current-window))

  ;; Custom agenda views
  ;; From https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html
  (setq org-agenda-custom-commands
        '(("c" "Simple agenda view"
           ((tags "PRIORITY=\"A\""
                  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "High Priority Tasks:")))
            (agenda "")
            (alltodo "")))
          ("n" "Enhanced TODO view with newest/oldest"
           ((alltodo ""
                     ((org-agenda-overriding-header "ðŸ“… 3 Most Recent TODOs")
                      (org-agenda-sorting-strategy '(timestamp-down))
                      (org-agenda-skip-function
                       '(or (org-agenda-skip-entry-if 'notregexp ":CREATED:")
                            (when (> (org-current-line)
                                    (+ (org-current-line) 3))
                              (point-max))))
                      (org-super-agenda-groups nil)))
            (alltodo ""
                     ((org-agenda-overriding-header "â³ 10 Oldest TODOs")
                      (org-agenda-sorting-strategy '(timestamp-up))
                      (org-agenda-skip-function
                       '(or (org-agenda-skip-entry-if 'notregexp ":CREATED:")
                            (when (> (org-current-line)
                                    (+ (org-current-line) 10))
                              (point-max))))
                      (org-super-agenda-groups nil)))
            (alltodo ""
                     ((org-agenda-overriding-header "All TODOs")
                      (org-super-agenda-groups
                       '((:name "High Priority"
                          :priority "A"
                          :order 1)
                         (:name "Personal Knowledge Management"
                          :category "pkm"
                          :order 2)
                         (:name "Getting Things Done"
                          :category "gtd"
                          :order 3)
                         (:name "Everything Else"
                          :anything t
                          :order 99)))))))))

  ;; Automatically refresh agenda files when entering agenda mode
  (add-hook 'org-agenda-mode-hook 'jf/refresh-org-agenda-files)

  ;; Refresh after org-roam operations that might create new files
  (with-eval-after-load 'org-roam
    (add-hook 'org-roam-capture-new-node-hook 'jf/refresh-org-agenda-files))

  ;; Manual refresh key binding
  (global-set-key (kbd "C-c r") 'jf/refresh-org-agenda-files)
#+end_src

*** Org QL

org-ql provides powerful querying capabilities for org files.

#+begin_src emacs-lisp
;; org-ql for powerful agenda queries
(use-package org-ql
  :straight t
  :after org)
#+end_src

*** Org Expiry

Automatically add CREATED property to new org entries for tracking creation time.

#+begin_src emacs-lisp
;; Automatically add CREATED property to new org entries
(use-package org-expiry
  :straight (org-contrib :includes org-expiry)
  :after org
  :config
  (setq org-expiry-created-property-name "CREATED")
  (setq org-expiry-inactive-timestamps t)
  (org-expiry-insinuate))
#+end_src

*** Org Super Agenda

Enhance agenda views with automatic grouping and filtering.

org-super-agenda provides flexible, customizable grouping for agenda items. It works by filtering items after org-agenda builds the view, allowing you to organize tasks by priority, tags, deadlines, and more.

See the [[https://github.com/alphapapa/org-super-agenda][official documentation]] for advanced grouping options.

**** Evil Mode Navigation in Agenda

evil-org-mode is enabled for org-agenda buffers (configured in =emacs/core/evil.org=), providing vim-style keybindings:

**Movement:**
- =j/k= - Move up/down through entries
- =gg/G= - Jump to top/bottom
- =C-d/C-u= - Scroll down/up half page

**Actions:**
- =RET= or =SPC= - Open item at point
- =TAB= - Show item details in other window
- =r= - Refresh agenda
- =q= - Quit agenda buffer
- =.= - Go to today

**Time Navigation:**
- =f/b= - Go forward/backward in time
- =d/w/m/y= - Switch to day/week/month/year view

**Other:**
- =t= - Show TODO entries
- =v= - View mode toggles (followed by another key)
- =?= - Show all keybindings

#+begin_src emacs-lisp
;; Enhanced agenda grouping with org-super-agenda
(use-package org-super-agenda
  :straight t
  :after org
  :config
  (org-super-agenda-mode 1)

  ;; Group by priority and category
  (setq org-super-agenda-groups
        '((:name "High Priority"
           :priority "A"
           :order 1)
          (:name "Personal Knowledge Management"
           :category "pkm"
           :order 2)
          (:name "Getting Things Done"
           :category "gtd"
           :order 3)
          (:name "Everything Else"
           :anything t
           :order 99))))
#+end_src

***** Agenda Tab Integration

Configure org-agenda to open TODO items in new tabs, integrating with vim-tab-bar.

When pressing RET on an agenda item, create a new tab and open the file there,
leaving the agenda accessible in its original location.

#+begin_src emacs-lisp
;; Function to open agenda items in new tabs
(defun my/org-agenda-switch-to-new-tab (orig-fn &rest args)
  "Advice for `org-agenda-switch-to' to open items in a new tab.
Creates a new tab before switching to the item, preserving the agenda view
in its original tab."
  (when (and (fboundp 'tab-bar-mode)
             tab-bar-mode)
    ;; Create a new tab - it will automatically switch to it
    (tab-bar-new-tab))
  ;; Call the original function - this will now happen in the new tab
  (apply orig-fn args))

;; Apply advice after org-agenda loads
(with-eval-after-load 'org-agenda
  (advice-add 'org-agenda-switch-to :around #'my/org-agenda-switch-to-new-tab))
#+end_src

***** TODO [#A] Set keybindings for org-insert-todo-heading and org-insert-todo-subheading
:PROPERTIES:
:CREATED:  [2025-12-29 Mon 16:33]
:CATEGORY: gtd
:END:

***** DONE Figure out how to refresh list of files read for agenda always
:PROPERTIES:
:CREATED:  [2026-01-09 Fri 21:27]
:CATEGORY: gtd
:END:

current approach doesn't see new files after the recursive list is loaded when emacs starts

** Capture Templates
Configure templates for quickly capturing notes and tasks.

#+begin_src emacs-lisp
;; Capture key binding
(define-key global-map (kbd "C-c c") 'org-capture)

;; Basic capture templates
(setq org-capture-templates
      '(("t" "todo" entry (file+headline "~/todo.org" "Tasks")
         "* TODO [#B] %?\n:PROPERTIES:\n:CREATED: %U\n:END:"
         :empty-lines-before 1)))
#+end_src

* Git Integration
Integrate Org mode with Git.

#+begin_src emacs-lisp
;; Git integration for Org
(use-package orgit
  :straight (orgit :type git :host github :repo "magit/orgit"))
#+end_src

* Auto-Tangle
Automatically tangle org files when saved.

#+begin_src emacs-lisp
;; ===============================================================================
;; Setup auto-tangle for org files
;; ===============================================================================

(use-package org-auto-tangle
  :straight t
  :hook (org-mode . org-auto-tangle-mode))
;; enable in a doc with #+auto_tangle: t
;; enable in all buffers with org-auto-tangle-default
#+end_src

* Additional Packages
Various packages that enhance the Org mode experience.

** Org Transclusion
Include content from other Org files.

#+begin_src emacs-lisp
;; ===============================================================================
;; Setup Org Transclude
;; ===============================================================================

(use-package org-transclusion
  :straight t
  :after org)
#+end_src

** Corg Completions
Better completions for org-babel and dynamic blocks.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install corg for org-babel and dynamic block completions
;; ===============================================================================
(use-package corg
  :straight (:host github :repo "isamert/corg.el"))
#+end_src

** Org Noter
Annotate PDFs with Org mode.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install org noter for annotating pdf files
;; ===============================================================================

(use-package org-noter
  :straight t)
#+end_src

** Org Download
Easily drag-and-drop images into Org files.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install org-download
;; ===============================================================================

(use-package org-download
  :straight t)
#+end_src

** Ob Async
Execute asynchronous org-babel source blocks.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install ob-async for async babel execution
;; ===============================================================================

(use-package ob-async
  :straight t
  :config)
  ;; Uncomment to disable async for specific languages
  ;(setq ob-async-no-async-languages-alist '("ipython"))
#+end_src

* Smart Link Insertion
Functions for intelligent org-link insertion with clipboard and browser history integration.

** URL Detection Helper
#+begin_src emacs-lisp
(defun jf/clipboard-contains-url-p ()
  "Check if clipboard contains a valid URL (http/https/file).
Returns the URL string if valid, nil otherwise."
  (when-let ((text (ignore-errors (current-kill 0 t))))
    (when (and (stringp text)
               (not (string-match-p "\n" text))
               (< (length text) 2000))
      (cond
       ((string-match-p "^https?://.+" text) text)
       ((string-match-p "^file://.+" text) text)
       (t nil)))))
#+end_src

** Main DWIM Function
#+begin_src emacs-lisp
(defun jf/org-insert-link-dwim ()
  "Insert org link intelligently.
If clipboard contains URL, use it and prompt for description.
Otherwise, search browser history."
  (interactive)
  (cond
   ;; Preserve region-wrapping behavior
   ((use-region-p)
    (call-interactively 'org-insert-link))

   ;; Preserve link-editing behavior
   ((org-in-regexp org-link-any-re)
    (call-interactively 'org-insert-link))

   ;; Clipboard URL path
   ((jf/clipboard-contains-url-p)
    (let* ((url (jf/clipboard-contains-url-p))
           (description (read-string
                        (format "Description for %s: "
                                (if (> (length url) 50)
                                    (concat (substring url 0 47) "...")
                                  url))
                        nil nil "")))
      (insert (org-link-make-string url description))))

   ;; Browser history fallback
   (t
    (jf/org-insert-link-from-browser-hist))))
#+end_src

** Browser History Helper
#+begin_src emacs-lisp
(defun jf/org-insert-link-from-browser-hist ()
  "Insert org link by searching browser history."
  (require 'browser-hist)

  (browser-hist--make-db-copy browser-hist-default-browser nil)

  (unwind-protect
      (condition-case nil
          (let* ((completion-styles '(basic partial-completion))
                 (selected-url
                  (completing-read "Browser history: "
                                 #'browser-hist--completion-table))
                 (rows-raw (browser-hist--send-query nil))
                 (title (alist-get selected-url rows-raw nil nil #'string=))
                 (description (read-string
                              (format "Description for %s: "
                                      (if (> (length selected-url) 50)
                                          (concat (substring selected-url 0 47) "...")
                                        selected-url))
                              title)))  ; Pre-fill with page title
            (insert (org-link-make-string selected-url description)))
        (quit nil))  ; Handle C-g cancellation

    ;; Always cleanup database connection
    (when browser-hist--db-connection
      (ignore-errors (sqlite-close browser-hist--db-connection))
      (setq browser-hist--db-connection nil))))
#+end_src
